espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/se_manager/src/sl_se_manager_cipher.c
  memset(gcm_ctx, 0, sizeof(sl_se_gcm_multipart_context_t));

  gcm_ctx->mode = mode;
  gcm_ctx->len = 0;
  gcm_ctx->add_len = add_len;

  SE_Command_t *se_cmd = &cmd_ctx->command;

  // The start context requires some data, either additional data or input data.
  // Case add_len > 0: Run start command with additonal data to create ctx_out.
  // Case add_len = 0: Store iv in gcm_ctx and run start function with input data
  // in sl_se_gcm_multipart_update. In the case of zero input data or
  // input data < 16 run sl_se_gcm_auth_decrypt()/sl_se_gcm_crypt_and_tag() in
  // sl_se_gcm_multipart_finish.
  if ( add_len > 0 ) {
    {
      // Encrypt: Compute tag and store it in context and output tag in finish.
      // Decrypt: Compute tag and store it in context and compare it to the
      // input tag in finish to verify it.

      // Explanation:The end-context in finish is currently not supporting 0 input data
      // for this config. For add_len = 0 and input_length = 0 we can run
      // sl_se_gcm_auth_decrypt()/sl_se_gcm_crypt_and_tag() in finish, so this is only
      // an issue for 0 input data and add_len != 0.
      SE_Command_t *se_cmd = &cmd_ctx->command;
      SE_DataTransfer_t iv_in = SE_DATATRANSFER_DEFAULT(iv, iv_len);
      SE_DataTransfer_t add_in = SE_DATATRANSFER_DEFAULT(add, add_len);
      SE_DataTransfer_t tag_out = SE_DATATRANSFER_DEFAULT(gcm_ctx->tagbuf,
                                                          sizeof(gcm_ctx->tagbuf));

      sli_se_command_init(cmd_ctx,
                          SLI_SE_COMMAND_AES_GCM_ENCRYPT
                          | SLI_SE_COMMAND_OPTION_CONTEXT_WHOLE);

      sli_add_key_parameters(cmd_ctx, key, status);
      SE_addParameter(se_cmd, add_len);
      SE_addParameter(se_cmd, 0);

      sli_add_key_metadata(cmd_ctx, key, status);
      sli_add_key_input(cmd_ctx, key, status);

      SE_addDataInput(se_cmd, &iv_in);
      SE_addDataInput(se_cmd, &add_in);
      SE_addDataOutput(se_cmd, &tag_out);

      status = sli_se_execute_and_wait(cmd_ctx);
      if (status != SL_STATUS_OK) {
        memset(gcm_ctx->tagbuf, 0, sizeof(gcm_ctx->tagbuf));
        return status;
      }
    }
    SE_DataTransfer_t iv_in = SE_DATATRANSFER_DEFAULT(iv, iv_len);
    SE_DataTransfer_t add_in = SE_DATATRANSFER_DEFAULT(add, add_len);
    SE_DataTransfer_t ctx_out =
      SE_DATATRANSFER_DEFAULT(gcm_ctx->se_ctx, sizeof(gcm_ctx->se_ctx));

    sli_se_command_init(cmd_ctx,
                        (gcm_ctx->mode == SL_SE_DECRYPT ? SLI_SE_COMMAND_AES_GCM_DECRYPT
                         : SLI_SE_COMMAND_AES_GCM_ENCRYPT)
                        | SLI_SE_COMMAND_OPTION_CONTEXT_START);

    sli_add_key_parameters(cmd_ctx, key, status);
    SE_addParameter(se_cmd, add_len);
    SE_addParameter(se_cmd, 0);

    sli_add_key_metadata(cmd_ctx, key, status);
    sli_add_key_input(cmd_ctx, key, status);

    SE_addDataInput(se_cmd, &iv_in);
    SE_addDataInput(se_cmd, &add_in);
    SE_addDataOutput(se_cmd, &ctx_out);

    status = sli_se_execute_and_wait(cmd_ctx);
    if (status != SL_STATUS_OK) {
      memset(gcm_ctx->se_ctx, 0, sizeof(gcm_ctx->se_ctx));
      return status;
    }
    gcm_ctx->first_operation = false;
  } else {
    memcpy(gcm_ctx->se_ctx, iv, iv_len);
    gcm_ctx->first_operation = true;
  }
  return SL_STATUS_OK;
}
#endif

/***************************************************************************//**
 * GCM streaming encryption/decryption, update stage. Deprecated.
 ******************************************************************************/
sl_status_t sl_se_gcm_update(sl_se_gcm_streaming_context_t *gcm_ctx,
                             size_t length,
                             const uint8_t *input,
                             uint8_t *output)
{
  uint32_t lena_lenc[4];
  sl_status_t status = SL_STATUS_OK;

  // Check input parameters.
  if (gcm_ctx == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }
  if (length == 0) {
    return SL_STATUS_OK;
  }
  if (length > 0 && (input == NULL || output == NULL)) {
    return SL_STATUS_INVALID_PARAMETER;
  }
  // Total length is restricted to 2^39 - 256 bits, ie 2^36 - 2^5 bytes.
  // Also check for possible overflow.
  if (gcm_ctx->len + length < gcm_ctx->len
      || (uint64_t)gcm_ctx->len + length > 0xFFFFFFFE0ULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }
  if (gcm_ctx->last_op == true) {
    // We've already closed the input stream, no way back.
    return SL_STATUS_INVALID_PARAMETER;
  }

  SE_Command_t *se_cmd = &gcm_ctx->cmd_ctx->command;
  sl_se_command_context_t *cmd_ctx = gcm_ctx->cmd_ctx;

  // Approach:
  // Encryption: encrypt regularly with context store. If input length is not
  // a block multiple, close the operation and store the resulting tag in a
  // tag buffer.
  // Decryption: decrypt regularly with context store. For each decryption,
  // re-encrypt the decrypted data with context store. If input length is not a
  // block multiple, close both operations and store the tag from the re-encrypt
  // in a tag buffer.
  // In both cases, the (re-)encryption is done twice: once assuming there is
  // more data to follow, and once assuming this is the final block.
  //   Explanation: SE doesn't support a type of 'finalize' command. All
  //   operations with 'END' set need to contain some data.

  // Figure out whether we'll be closing out
  bool first_op = (gcm_ctx->add_len == 0 && gcm_ctx->len == 0) ? true : false;
  if ( length % 16 != 0) {
    // Indicate that this is our last op
    gcm_ctx->last_op = true;
  }
  if (first_op && gcm_ctx->last_op) {
    // Need to store length in context for later.
    gcm_ctx->len = length;
    return sl_se_gcm_crypt_and_tag(gcm_ctx->cmd_ctx,
                                   gcm_ctx->key,
                                   (sl_se_cipher_operation_t)gcm_ctx->mode,
                                   length,
                                   gcm_ctx->se_ctx_enc, 12,
                                   NULL, 0,
                                   input, output,
                                   // Compute max tag size (16 bytes)
                                   // and store it in the context
                                   16, gcm_ctx->tagbuf);
  }
  lena_lenc[0] = __REV(gcm_ctx->add_len >> 29);
  lena_lenc[1] = __REV((gcm_ctx->add_len << 3) & 0xFFFFFFFFUL);
  lena_lenc[2] = __REV((gcm_ctx->len + length) >> 29);
  lena_lenc[3] = __REV(((gcm_ctx->len + length) << 3) & 0xFFFFFFFFUL);

  gcm_ctx->len += length;

  if (gcm_ctx->mode == SL_SE_DECRYPT) {
    // Run decryption first
    SE_DataTransfer_t iv_ctx_in = SE_DATATRANSFER_DEFAULT(
      first_op ? gcm_ctx->se_ctx_enc : gcm_ctx->se_ctx_dec,
      first_op ? 12 : sizeof(gcm_ctx->se_ctx_dec));

    SE_DataTransfer_t data_in = SE_DATATRANSFER_DEFAULT((void*)input, length);
    SE_DataTransfer_t lenalenc_in = SE_DATATRANSFER_DEFAULT(lena_lenc, sizeof(lena_lenc));
    SE_DataTransfer_t data_out = SE_DATATRANSFER_DEFAULT(output, length);
    SE_DataTransfer_t ctx_out = SE_DATATRANSFER_DEFAULT(gcm_ctx->se_ctx_dec,
                                                        sizeof(gcm_ctx->se_ctx_dec));
    SE_DataTransfer_t mac_in = SE_DATATRANSFER_DEFAULT(gcm_ctx->tagbuf,
                                                       sizeof(gcm_ctx->tagbuf));

    sli_se_command_init(cmd_ctx,
                        SLI_SE_COMMAND_AES_GCM_DECRYPT
                        | (first_op
                           ? SLI_SE_COMMAND_OPTION_CONTEXT_START
                           : (gcm_ctx->last_op
                              ? SLI_SE_COMMAND_OPTION_CONTEXT_END
                              : SLI_SE_COMMAND_OPTION_CONTEXT_ADD)));

    sli_add_key_parameters(cmd_ctx, gcm_ctx->key, status);
    SE_addParameter(se_cmd, 0);
    SE_addParameter(se_cmd, length);

    sli_add_key_metadata(cmd_ctx, gcm_ctx->key, status);
    sli_add_key_input(cmd_ctx, gcm_ctx->key, status);

    SE_addDataInput(se_cmd, &iv_ctx_in);
    SE_addDataInput(se_cmd, &data_in);
    SE_addDataOutput(se_cmd, &data_out);
    if (!gcm_ctx->last_op) {
      SE_addDataOutput(se_cmd, &ctx_out);
    } else {
      SE_addDataInput(se_cmd, &lenalenc_in);
      SE_addDataInput(se_cmd, &mac_in);
    }

    status = sli_se_execute_and_wait(cmd_ctx);
    if ((status != SL_STATUS_OK) && (status != SL_STATUS_INVALID_SIGNATURE)) {
      memset(output, 0, length);
      memset(gcm_ctx->se_ctx_dec, 0, sizeof(gcm_ctx->se_ctx_dec));
      return status;
    }
  }

  if (!gcm_ctx->last_op) {
    // We need to do the final calculation first, such that we keep the input
    // context intact.

    SE_DataTransfer_t iv_ctx_in =
      SE_DATATRANSFER_DEFAULT(gcm_ctx->se_ctx_enc,
                              first_op ? 12 : sizeof(gcm_ctx->se_ctx_enc));
    SE_DataTransfer_t data_in =
      SE_DATATRANSFER_DEFAULT(gcm_ctx->mode == SL_SE_ENCRYPT
                              ? (void*)input : (void*)output,
                              length);
    SE_DataTransfer_t lenalenc_in = SE_DATATRANSFER_DEFAULT(&lena_lenc[0],
                                                            sizeof(lena_lenc));
    SE_DataTransfer_t data_out = SE_DATATRANSFER_DEFAULT(NULL, length);
    SE_DataTransfer_t tag_out = SE_DATATRANSFER_DEFAULT(gcm_ctx->tagbuf,
                                                        sizeof(gcm_ctx->tagbuf));

    sli_se_command_init(cmd_ctx,
                        SLI_SE_COMMAND_AES_GCM_ENCRYPT
                        | (first_op
                           ? SLI_SE_COMMAND_OPTION_CONTEXT_WHOLE
                           : SLI_SE_COMMAND_OPTION_CONTEXT_END));

    sli_add_key_parameters(cmd_ctx, gcm_ctx->key, status);
    SE_addParameter(se_cmd, 0);
    SE_addParameter(se_cmd, length);

    sli_add_key_metadata(cmd_ctx, gcm_ctx->key, status);
    sli_add_key_input(cmd_ctx, gcm_ctx->key, status);

    SE_addDataInput(se_cmd, &iv_ctx_in);
    SE_addDataInput(se_cmd, &data_in);
    if (!first_op) {
      SE_addDataInput(se_cmd, &lenalenc_in);
    }
    data_out.length |= SE_DATATRANSFER_DISCARD;
    SE_addDataOutput(se_cmd, &data_out);
    SE_addDataOutput(se_cmd, &tag_out);

    status = sli_se_execute_and_wait(cmd_ctx);
    if (status != SL_STATUS_OK) {
      memset(gcm_ctx->tagbuf, 0, sizeof(gcm_ctx->tagbuf));
      return status;
    }
  }

  {
    SE_DataTransfer_t iv_ctx_in =
      SE_DATATRANSFER_DEFAULT(gcm_ctx->se_ctx_enc,
                              first_op ? 12 : sizeof(gcm_ctx->se_ctx_enc));
    SE_DataTransfer_t data_in =
      SE_DATATRANSFER_DEFAULT(gcm_ctx->mode == SL_SE_ENCRYPT
                              ? (void*)input
                              : (void*)output, length);
    SE_DataTransfer_t lenalenc_in = SE_DATATRANSFER_DEFAULT(&lena_lenc[0],
                                                            sizeof(lena_lenc));

    SE_DataTransfer_t data_out = SE_DATATRANSFER_DEFAULT(output, length);
    SE_DataTransfer_t tag_out = SE_DATATRANSFER_DEFAULT(gcm_ctx->tagbuf,
                                                        sizeof(gcm_ctx->tagbuf));
    SE_DataTransfer_t ctx_out = SE_DATATRANSFER_DEFAULT(gcm_ctx->se_ctx_enc,
                                                        sizeof(gcm_ctx->se_ctx_enc));

    sli_se_command_init(cmd_ctx,
                        SLI_SE_COMMAND_AES_GCM_ENCRYPT
                        | (first_op
                           ? SLI_SE_COMMAND_OPTION_CONTEXT_START
                           : (gcm_ctx->last_op
                              ? SLI_SE_COMMAND_OPTION_CONTEXT_END
                              : SLI_SE_COMMAND_OPTION_CONTEXT_ADD)));

    sli_add_key_parameters(cmd_ctx, gcm_ctx->key, status);
    SE_addParameter(se_cmd, 0);
    SE_addParameter(se_cmd, length);

    sli_add_key_metadata(cmd_ctx, gcm_ctx->key, status);
    sli_add_key_input(cmd_ctx, gcm_ctx->key, status);

    SE_addDataInput(se_cmd, &iv_ctx_in);
    SE_addDataInput(se_cmd, &data_in);
    if (gcm_ctx->last_op) {
      SE_addDataInput(se_cmd, &lenalenc_in);
    }
    if (gcm_ctx->mode == SL_SE_DECRYPT) {
      data_out.data = NULL;
      data_out.length |= SE_DATATRANSFER_DISCARD;
    }
    SE_addDataOutput(se_cmd, &data_out);

